go-go-golems/esp32-s3-m5/0100-esp32-p4-quickjs-wasm/sdkconfig.defaults
# 0100 — ESP32-P4 QuickJS compiled to WASM, run via WAMR.
# Baseline merged from 0099 (P4 target/console/PSRAM) + 0079 (WAMR toggles).
# See design doc: design/01-quickjs-wasm-esp32p4-analysis-design-and-implementation-guide.md

# --- Target + console (from 0099; P4 has NO USB Serial/JTAG, uses CH343 on UART0) ---
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- Flash + PSRAM (from 0099; ESP32-P4NRW32 stacked PSRAM) ---
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
# Custom partition table: the embedded quickjs.wasm (~1.2 MB) + WAMR make the
# app ~1.8 MB, larger than the default 1 MB factory partition.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# --- WAMR runtime (symbol names from 0079/.../espressif__wasm-micro-runtime/.../Kconfig) ---
CONFIG_WAMR_BUILD_RELEASE=y
CONFIG_WAMR_ENABLE_INTERP=y
CONFIG_WAMR_INTERP_FAST=y
CONFIG_WAMR_INTERP_LOADER_NORMAL=y
CONFIG_WAMR_ENABLE_LIBC_BUILTIN=y
CONFIG_WAMR_ENABLE_LIBC_WASI=y
CONFIG_WAMR_ENABLE_LIB_PTHREAD=y
CONFIG_WAMR_ENABLE_APP_FRAMEWORK=n
CONFIG_WAMR_ENABLE_MULTI_MODULE=n
CONFIG_WAMR_ENABLE_AOT=n
CONFIG_WAMR_ENABLE_REF_TYPES=y
CONFIG_WAMR_ENABLE_SHARED_MEMORY=n
CONFIG_WAMR_APP_THREAD_STACK_SIZE_MAX=65536
